{"format": "graph-model", "generatedBy": "2.11.0", "convertedBy": "TensorFlow.js Converter v4.2.0", "signature": {"inputs": {"conv2d_42_input": {"name": "conv2d_42_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "6"}, {"size": "7"}, {"size": "1"}]}}}, "outputs": {"dense_65": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "7"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_21/conv2d_42/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "1"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_21/conv2d_42/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_21/conv2d_43/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_21/conv2d_43/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_21/flatten_21/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_21/dense_63/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_21/dense_63/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_21/dense_64/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_21/dense_64/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_21/dense_65/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "7"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_21/dense_65/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}]}}}}}, {"name": "conv2d_42_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "6"}, {"size": "7"}, {"size": "1"}]}}}}, {"name": "StatefulPartitionedCall/sequential_21/conv2d_42/Relu", "op": "_FusedConv2D", "input": ["conv2d_42_input", "StatefulPartitionedCall/sequential_21/conv2d_42/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_21/conv2d_42/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "num_host_args": {"i": "0"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "filter_format": {"s": "SFdJTw=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_21/conv2d_43/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_21/conv2d_42/Relu", "StatefulPartitionedCall/sequential_21/conv2d_43/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_21/conv2d_43/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "leakyrelu_alpha": {"f": 0.2}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "filter_format": {"s": "SFdJTw=="}, "num_host_args": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/sequential_21/flatten_21/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_21/conv2d_43/Relu", "StatefulPartitionedCall/sequential_21/flatten_21/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_21/dense_63/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_21/flatten_21/Reshape", "StatefulPartitionedCall/sequential_21/dense_63/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_21/dense_63/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_21/dense_64/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_21/dense_63/Relu", "StatefulPartitionedCall/sequential_21/dense_64/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_21/dense_64/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_b": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_21/dense_65/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_21/dense_64/Relu", "StatefulPartitionedCall/sequential_21/dense_65/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_21/dense_65/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_21/dense_65/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_21/dense_65/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_21/dense_65/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1286}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_21/conv2d_42/Conv2D/ReadVariableOp", "shape": [4, 4, 1, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_21/conv2d_42/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_21/conv2d_43/Conv2D/ReadVariableOp", "shape": [2, 2, 64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_21/conv2d_43/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_21/flatten_21/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_21/dense_63/MatMul/ReadVariableOp", "shape": [384, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_21/dense_63/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_21/dense_64/MatMul/ReadVariableOp", "shape": [64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_21/dense_64/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_21/dense_65/MatMul/ReadVariableOp", "shape": [64, 7], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_21/dense_65/BiasAdd/ReadVariableOp", "shape": [7], "dtype": "float32"}]}]}